Revit 2024 API
MEPAnalyticalSystem.GetWaterLoopData Method
 Returns the water loop data, null if not available.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020.1
Syntax
C#
public WaterLoopData GetWaterLoopData()
Visual Basic
Public Function GetWaterLoopData As WaterLoopData
Visual C++
public:
WaterLoopData^ GetWaterLoopData()
See Also
MEPAnalyticalSystem Class
Autodesk.Revit.DB.Mechanical Namespace